pandas dataframe is a 2 dimensional labeled data structure

#A pandas DataFrame can be created using the following constructor âˆ’
#pandas.DataFrame( data, index, columns, dtype, copy)

In [1]:
#import the pandas library and aliasing as pd empty dataframe
import pandas as pd
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [2]:
#Create a DataFrame from Lists

data = [1,2,3,4,5]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [3]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [4]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'],dtype=float,index=["A","B","C"])
df

     Name   Age
A    Alex  10.0
B     Bob  12.0
C  Clarke  13.0

In [5]:
#Create a DataFrame from Dict of ndarrays / Lists

data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
df

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [6]:
#Let us now create an indexed DataFrame using arrays.
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
df

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [7]:
#Create a DataFrame from List of Dicts
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data)
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [8]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data, index=['first', 'second'])
df

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [9]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df=pd.DataFrame(data,index=['row1','row2'],columns=['a','b'])
df

      a   b
row1  1   2
row2  5  10

In [10]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df=pd.DataFrame(data,index=['row1','row2'],columns=['a','b1'])
df

      a  b1
row1  1 NaN
row2  5 NaN

In [11]:
#Create a DataFrame from Dict of Series


d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [12]:
#Column Selection

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [13]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [14]:
# Adding a new column to an existing DataFrame object with column label by passing new series

df['three']=pd.Series([10,20,30],index=['a','b','c'])
df

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

In [15]:
print ("Adding a new column using the existing columns in DataFrame:")
df['four']=df['one']+df['three']
df

Adding a new column using the existing columns in DataFrame:

   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2   20.0  22.0
c  3.0    3   30.0  33.0
d  NaN    4    NaN   NaN

In [16]:
#Column Deletion



d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']), 
   'three' : pd.Series([10,20,30], index=['a','b','c'])}

df = pd.DataFrame(d)
print ("Our dataframe is:")
df

Our dataframe is:

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

In [17]:
# using del function
print ("Deleting the first column using DEL function:")
del df['one']
df

Deleting the first column using DEL function:

   two  three
a    1   10.0
b    2   20.0
c    3   30.0
d    4    NaN

In [18]:
# using pop function
print ("Deleting another column using POP function:")
df.pop('two')
df

Deleting another column using POP function:

   three
a   10.0
b   20.0
c   30.0
d    NaN

In [19]:
d = {'one' : pd.Series([1, 2, 3,], index=['a', 'b', 'c',]), 
   'two' : pd.Series([3,5,6,7], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0    3
b  2.0    5
c  3.0    6
d  NaN    7